{"imports": ["constant_op", "dtypes", "ops", "array_ops", "summary_ops_v2", "gfile"], "function_calls": ["MakeDirs", "run", "run", "SerializeToString", "run", "flush", "run"], "strings": ["Writes events to disk in a logdir.", "Writes `Event` protocol buffers to an event file via the graph.\n\n  The `EventFileWriterV2` class is backed by the summary file writer in the v2\n  summary API (currently in tf.contrib.summary), so it uses a shared summary\n  writer resource and graph ops to write events.\n\n  As with the original EventFileWriter, this class will asynchronously write\n  Event protocol buffers to the backing file. The Event file is encoded using\n  the tfrecord format, which is similar to RecordIO.\n  ", "Creates an `EventFileWriterV2` and an event file to write to.\n\n    On construction, this calls `tf.contrib.summary.create_file_writer` within\n    the graph from `session.graph` to look up a shared summary writer resource\n    for `logdir` if one exists, and create one if not. Creating the summary\n    writer resource in turn creates a new event file in `logdir` to be filled\n    with `Event` protocol buffers passed to `add_event`. Graph ops to control\n    this writer resource are added to `session.graph` during this init call;\n    stateful methods on this class will call `session.run()` on these ops.\n\n    Note that because the underlying resource is shared, it is possible that\n    other parts of the code using the same session may interact independently\n    with the resource, e.g. by flushing or even closing it. It is the caller's\n    responsibility to avoid any undesirable sharing in this regard.\n\n    The remaining arguments to the constructor (`flush_secs`, `max_queue`, and\n    `filename_suffix`) control the construction of the shared writer resource\n    if one is created. If an existing resource is reused, these arguments have\n    no effect.  See `tf.contrib.summary.create_file_writer` for details.\n\n    Args:\n      session: A `tf.compat.v1.Session`. Session that will hold shared writer\n        resource. The writer ops will be added to session.graph during this\n        init call.\n      logdir: A string. Directory where event file will be written.\n      max_queue: Integer. Size of the queue for pending events and summaries.\n      flush_secs: Number. How often, in seconds, to flush the\n        pending events and summaries to disk.\n      filename_suffix: A string. Every event file's name is suffixed with\n        `filename_suffix`.\n    ", "Returns the directory where event file will be written.", "Reopens the EventFileWriter.\n\n    Can be called after `close()` to add more events in the same directory.\n    The events will go into a new events file.\n\n    Does nothing if the EventFileWriter was not closed.\n    ", "Adds an event to the event file.\n\n    Args:\n      event: An `Event` protocol buffer.\n    ", "Flushes the event file to disk.\n\n    Call this method to make sure that all pending events have been written to\n    disk.\n    ", "Flushes the event file to disk and close the file.\n\n    Call this method when you do not need the summary writer anymore.\n    ", "", "feed_dict"]}